[{"Unnamed: 0":0,"Family":"Oxalidaceae","Vernacular names":"Puliyarila","Distribution":"Cosmopolitan","Description":"Prostrate herbs with creeping stem. Leaves digitately 3-foliolate. Flowers yellow, solitary or in axillary umbels. Capsules, linear, puberulous outside; seeds many, minute, brown.","Habit":"Herb","Habitat":"Degraded forests, also in the plains","Flowering & Fruiting":"March-December","Parts used":"Whole plant","Properties & Uses":"Plant is cooling, antiseptic, astringent, appetizer and antiscorbutic; useful in fevers and biliousness; juice of the plant cures scurvy, piles, anemia and tympanites; also relieves the intoxication produced by Datura. Expressed juice made into a sherbet is prescribed in dysentery, prolapse of the rectum and also allays thirst. Fresh leaves made into a curry are said to improve appetite and digestion of dyspeptic patients. They have also been used for removing corns, warts and other excrescences on the skin. Decoction of the leaves is prescribed in fevers and dysentery. An infusion of the leaves is used externally to remove opacities of the cornea.","Systems of Medicines":"Ayurveda, Folk, Unani,","Scientific Name":"oxalis corniculata","Traditional Uses":null,"Conservation Status":null,"Synonyms:":null},{"Unnamed: 0":1,"Family":"Nyctaginaceae","Vernacular names":"Thazhuthama","Distribution":"Pantropical","Description":"Prostrate herbs. Leaves unequal, ovate, obtuse, undulate along margins. Flowers red, pink or white, in axillary or terminal, peduncled umbels. Capsule clavate, 5-ribbed, glandular.","Habit":"Herb","Habitat":"Moist and dry deciduous forests and also in the plains","Flowering & Fruiting":"August-December","Parts used":"Whole plant","Properties & Uses":"Laxative, diuretic, expectorant, antipyretic and cardiotonic. Decoction of the root is stimulating heart and kidney function, also used for the treatment of jaundice, piles, rheumatism, asthma, dropsy, diabetes, general debility and oedema. Crushed leaves are used as an external application for swellings and boils. Leaf juice lotion is used for treating ophthalmia and given internally as a blood purifier; it also helps to relieve muscular pain.","Systems of Medicines":"Ayurveda, Folk, Unani, Homeo,","Scientific Name":"boerhavia diffusa","Traditional Uses":"Fresh leaf juice is used as a lotion for eye diseases.","Conservation Status":null,"Synonyms:":null},{"Unnamed: 0":2,"Family":"Zingiberaceae","Vernacular names":"Chittaratha","Distribution":"Indo-Malesia","Description":"Rhizomatous herbs. Leaves sessile, lamina glabrous, linear-lanceolate. Inflorescence terminal, densely paniculate, lower cincinni 4-flowered, upper 2-flowered. Flowers white streaked with red and yellow. Fruit globose; seeds many.","Habit":"Herb","Habitat":"Widely cultivated, sometimes runs wild","Flowering & Fruiting":"May-December","Parts used":"Rhizomes","Properties & Uses":"Rhizome is stomachic, stimulant, aphrodisiac, diuretic, expectorant and carminative. It is used for the treatment of headache, bronchitis, lumbago, rheumatic pains, sore throat, stuttering, pain in the chest, diabetes, burning of the liver and tubercular glands.","Systems of Medicines":"Ayurveda,","Scientific Name":"alpinia calcarata","Traditional Uses":null,"Conservation Status":null,"Synonyms:":null},{"Unnamed: 0":3,"Family":"Malvaceae","Vernacular names":"Elavu","Distribution":"Tropical-Asia-New-Guinea","Description":"Large trees. Leaves digitately-compound, alternate, stipulate; stipules small. Flowers bisexual, dark crimson. Fruit a capsule, downy tomentose, cylindrical, blackish and glabrous at maturity; seeds numerous, pyriform, smooth, dark brown, embedded in white cotton.","Habit":"Tree","Habitat":"Moist deciduous and semi-evergreen forests, also in the plains","Flowering & Fruiting":"January-April","Parts used":"Leaves, flowers, fruits and exudates","Properties & Uses":"Cooling and expectorant. The paste of flower and leaves is applied externally to relieve swellings, boils and various skin diseases. The young fruits are used as an expectorant, diuretic and also used for the treatment of chronic inflammation, ulceration of the bladder and kidneys. The infusion of the stem bark is used as a styptic and also for fomenting wounds.","Systems of Medicines":"Ayurveda, Folk, Unani,","Scientific Name":"bombax ceiba","Traditional Uses":"The paste form of leaves and flowers applied externally to relieve swellings and various skin diseases.","Conservation Status":null,"Synonyms:":null},{"Unnamed: 0":4,"Family":"Oxalidaceae","Vernacular names":"Mukkutti","Distribution":"Indo-Malesia-and-China","Description":"Erect herbs. Leaves 12-17 jugate. Flowers yellow, umbellate in many flowered axillary peduncles. Fruits glandular hairy on the ribs; seeds 1-2 per cell, transversely ridged and tubercled.","Habit":"Herb","Habitat":"Moist deciduous forests and plantations, also in the plains","Flowering & Fruiting":"July-December","Parts used":"Whole plant","Properties & Uses":"Whole plant is used for the treatment of urinary calculi, fever, wounds, snake bite and asthma.","Systems of Medicines":"Ayurveda, Unani,","Scientific Name":"biophytum reinwardtii","Traditional Uses":null,"Conservation Status":null,"Synonyms:":null},{"Unnamed: 0":5,"Family":"Apocynaceae","Vernacular names":"Amalpori","Distribution":"South-and-south-east Asia","Description":"Subshrubs, rootstock thick, sap watery. Leaves oblanceolate, acuminate at both ends. Cymes axillary and terminal, densely flowered. Flowers white with pinkish dot. Capsules ovoid, obtuse, black; fruiting calyx crimson.","Habit":"Shrub","Habitat":"Moist deciduous forests, also in the plains","Flowering & Fruiting":"April-October","Parts used":"Root","Properties & Uses":"The roots is used to reduce high blood pressure and for treating disorders in central nervous systems. The powdered roots are given orally as an antidote to snake venom. Extracts of roots are valued for the treatment of intestinal disorders, diarrhea and dysentery.","Systems of Medicines":"Ayurveda, Folk, Unani, Homeo, Modern,","Scientific Name":"rauvolfia serpentina","Traditional Uses":"The decoction of root taken internally to cure stomach disorders.","Conservation Status":"Endangered.","Synonyms:":null},{"Unnamed: 0":6,"Family":"Lamiaceae","Vernacular names":"Thumba","Distribution":"Indo-Malesia","Description":"Herbs. Leaves sub-sessile, linear-lanceolate. Flowers white, small, in dense terminal or axillary whorls. Fruits nutlets, oblong.","Habit":"Herb","Habitat":"Deciduous forests and wastelands","Flowering & Fruiting":"September-January","Parts used":"Leaves and flowers","Properties & Uses":"Carminative, digestive, anthelmintic, anti-pyretic, anti-inflammatory and expectorant. Leaves and flowers are used for the treatment of colic, cough, asthma, chronic skin diseases, fever, ulcers, verminosis and catarrh in children. Juice of leaves are used as an eye drop in encephalopathy due to worm infestation in children.","Systems of Medicines":"Ayurveda, Folk, Unani, Homeo,","Scientific Name":"leucas aspera","Traditional Uses":"Fresh leaves are pounded into paste and applied on forehead to relieve headache.","Conservation Status":null,"Synonyms:":null},{"Unnamed: 0":7,"Family":"Solanaceae","Vernacular names":"Madanam","Distribution":"Paleotropics","Description":"Subshrubs. Leaves entire or angled with acute lobes, ovate. Flowers purplish outside and white inside, solitary in axil, erect. Capsule spherical, covered with short spines; seeds compressed, smooth, brown.","Habit":"Shrub","Habitat":"Degraded deciduous forests and wastelands","Flowering & Fruiting":"March-December","Parts used":"Whole plant","Properties & Uses":"Narcotic, antispasmodic, bitter, acrid, astringent, sedative, febrifuge and anthelmintic. The warmed leaves are used to treat guinea worms. Young and fresh leaves are used to treat amenorrhoea and mixed with lime is used to treat scabies. Fresh juice is used in painful swellings and earache. Pounded leaves are used to treat skin diseases, ulcers, bronchitis, jaundice, piles and fever.","Systems of Medicines":"Ayurveda, Unani, Homeo, Modern,","Scientific Name":"datura metel","Traditional Uses":null,"Conservation Status":null,"Synonyms:":null},{"Unnamed: 0":8,"Family":"Apocynaceae","Vernacular names":"Vallippala","Distribution":"Indo-Malesia","Description":"Slender, pubescent climbers; leaves opposite, ovate to oblong, acute or acuminate apex, base subcordate, entire, slightly pubescent on both sides. Flowers greenish-purplish or greenish-yellow, in umbellate cymes. Follicle oblong, tapering towards the apex, glabrous; seeds broadly ovate.","Habit":"Climbers\/Lianas","Habitat":"Deciduous forests, along bushes and thickets","Flowering & Fruiting":"February-July","Parts used":"Whole plant","Properties & Uses":"Anti-asthmatic, expectorant and anti-rheumatic. Roots are used in chronic bronchitis, asthma, early stages of whooping cough and relieving pain due top gout. The powdered root is used for treating intermittent fever and root paste is used in jaundice. The decoction of leaves or root is useful for treating bronchial asthma, diarrhea and dysentery.","Systems of Medicines":"Ayurveda, Folk, Unani, Homeo,","Scientific Name":"tylophora indica","Traditional Uses":null,"Conservation Status":null,"Synonyms:":null},{"Unnamed: 0":9,"Family":"Capparaceae","Vernacular names":"Neermathalam","Distribution":"Indo-Malesia-and-China","Description":"Trees. Leaves digitately trifoliate, alternate, estipulate. Flowers bisexual, creamy white, in terminal corymbs. Fruit a berry, globose or ovoid, yellowish-grey, rind woody; seeds brown, embedded in pulp.","Habit":"Tree","Habitat":"River banks in semi-evergreen forests","Flowering & Fruiting":"March-April","Parts used":"Leaves, bark, stem and flowers","Properties & Uses":"Carminative, laxative, anthelmintic, diuretic, lithontriptic, expectorant and demulcent. The dried bark is internally administered to cure diseases like renal calculi, dysuria, helminthiasis, inflammations, cough, asthma, bronchitis and skin diseases.","Systems of Medicines":"Ayurveda, Unani,","Scientific Name":"crateva religiosa","Traditional Uses":null,"Conservation Status":null,"Synonyms:":"Crateva magna (Lour.) DC."},{"Unnamed: 0":10,"Family":"Combretaceae","Vernacular names":"Thanni","Distribution":"Indo-Malesia","Description":"Large trees. Leaves simple, opposite or alternate, clustered at the tip of branchlets. Flowers bisexual, greenish-yellow, in axillary spikes; peduncle puberulus. Fruit a drupe; seed one, ellipsoid.","Habit":"Tree","Habitat":"Semi-evergreen and moist deciduous forests, also in the plains","Flowering & Fruiting":"December-January","Parts used":"Fruit","Properties & Uses":"Laxative and anthelmintic. The fruit is used to treat bronchitis, sore throat, biliousness, inflammation, asthma and diseases of eye, nose, heart and bladder. The fruit pulp is used to treat dropsy, piles, diarrhea and leprosy.","Systems of Medicines":"Ayurveda, Folk, Unani,","Scientific Name":"terminalia bellirica","Traditional Uses":"Bark decoction taken internally to promote urination.","Conservation Status":null,"Synonyms:":null},{"Unnamed: 0":11,"Family":"Primulaceae","Vernacular names":"Vizhal","Distribution":"Indo-Malesia-and-South China","Description":"Woody climbers. Leaves elliptic, acute at both ends. Panicles glabrous, branches long, slender racemose. Flowers white, many. Berry, globose.","Habit":"Climbers\/Lianas","Habitat":"Semi-evergreen, evergreen and shola forests","Flowering & Fruiting":"March-August","Parts used":"Fruits, roots and bark","Properties & Uses":"Fruit is a good appetizer, alterative, carminative, stomachic, anthelmintic, analgesic, purgative and tonic; useful in ascites, bronchitis, jaundice, hemicrania, dyspepsia and skin diseases. It is effective against intestinal worms specially tapeworms. Roots are used as an anti-fertility drug. Decoction of the root is a very effective medicine against influenza and the infusion is effective against cough and diarrhoea. An infusion of the leaves is used in jaundice.","Systems of Medicines":"Ayurveda, Folk, Unani, Homeo,","Scientific Name":"embelia-ribes","Traditional Uses":null,"Conservation Status":"Near threatened.","Synonyms:":null},{"Unnamed: 0":12,"Family":"Convolvulaceae","Vernacular names":"Krishnakranti","Distribution":"Pantropical","Description":"Prostrate much branched villous herbs. Leaves more or less distinctly in 2 rows. Flowers blue, solitary or paired at axils. Capsule, globose, 2-valved. Seeds usually 4, minute.","Habit":"Herb","Habitat":"Moist deciduous forests, also in the plains","Flowering & Fruiting":"March-August","Parts used":"Whole plant","Properties & Uses":"Anthelmintic, expectorant, carminative and rejuvenator. Whole plant is used as a brain tonic and to treat nervous debility and dysentery. Plant extract mixed with cumin and milk helps to relief fever and to treat memory loss, nervous debility and syphilis. The leaves are used in bronchitis and asthma. The roots are used in gastric problem and duodenal ulcer. The flowers are useful in uterine bleeding.","Systems of Medicines":"Ayurveda, Folk, Unani,","Scientific Name":"evolvulus alsinoides","Traditional Uses":"The fresh plant juice is taken internally to cure bronchitis and asthma.","Conservation Status":null,"Synonyms:":null},{"Unnamed: 0":13,"Family":"Apocynaceae","Vernacular names":"Ezhilamppala","Distribution":"South-and-South-East-Asia-Australia","Description":"Large trees. Leaves simple, whorled, estipulate. Flower bisexual, greenish-white in terminal umbellate cymes. Fruit of two linear, narrow, pendulous follicular mericarps, green; seeds 5-6 mm long, flat, commate at both ends.","Habit":"Tree","Habitat":"Moist deciduous forests also in the plains","Flowering & Fruiting":"October-February","Parts used":"Bark, leaves and milky exudate","Properties & Uses":"The bark is useful in fever, malarial fevers, abdominal disorders, diarrhoea, asthma, skin diseases, ulcers and rheumatic swellings. The tender leaves in the form of poultice are good for ulcers with foul discharges.","Systems of Medicines":"Ayurveda, Folk, Unani, Homeo,","Scientific Name":"alstonia scholaris","Traditional Uses":"The milky latex of the plant is used to treat wounds caused by burns and boils.","Conservation Status":null,"Synonyms:":null},{"Unnamed: 0":14,"Family":"Malvaceae","Vernacular names":"Pooparutthi, Poovarasu,പൂപ്പരുത്തി, പൂവരശ്(Malayalam),Indian tulip tree(English),Parisha(Sanskrit),Porush(Hindi),Puvarasu(Tamil)","Distribution":"Pantropical","Description":"Small trees, bark dark brown. Leaves simple, alternate, stipulate. Flowers bisexual, yellow, showy, solitary or in cymes, axillary or terminal. Fruit a capsule, globose, indehiscent; seeds many, ovoid.","Habit":"Tree","Habitat":"Grown as fence-posts and avenue tree, also in mangrove forests","Flowering & Fruiting":"March-June","Parts used":"Whole plant","Properties & Uses":"The bark, leaves, flowers and fruits are useful in cutaneous affections such as scabies, psoriasis, ringworm and eczema. Yellow juice of the peduncles and fruits are useful in sprains, bruises and cutaneous diseases. Decoction of the bark is given internally in chronic dysentery. Oil prepared by boiling the ground bark in coconut oil is applied in psoriasis and scabies. Ground leaves and contents of the capsule applied externally in eczema and ring worms. A compound oil of the bark and capsule is beneficial in cases of urethritis and gonorrhea. Seeds possess purgative properties.","Systems of Medicines":"Ayurveda, Folk, Unani,","Scientific Name":"thespesia populnea","Traditional Uses":null,"Conservation Status":null,"Synonyms:":null},{"Unnamed: 0":15,"Family":"Oxalidaceae","Vernacular names":"Chathurapuli, Anapulinchi, Thamaratha,ചതുരപ്പുളി, ആനപ്പുളിഞ്ചി(Malayalam),Carambola apple(English),Karmaranga(Sanskrit),Karmal(Hindi),Tamarathai(Tamil)","Distribution":"Indonesia","Description":"Small trees. Leaves scattered; leaflets 3-6 pairs, variable. Inflorescence axillary, rarely on branches, flowers bright red, yellowish-brown with pale margin when dry. Fruits ovoid to ellipsoid with 5 acute longitudinal ridges; seeds aril 2-lipped, enclosing seed, fleshy.","Habit":"Tree","Habitat":"Cultivated Flowering and  Fruiting May-August","Flowering & Fruiting":null,"Parts used":"Root, leaves, flowers, fruits and seeds","Properties & Uses":"Fruits are tonic, refrigerant and antiscorbutic. Green fruits are astringent to the bowels. Ripe fruit is a good remedy for bleeding piles, particularly for internal piles. It is also useful in relieving thirst and febrile excitement. Juice of the fruit is given in dysentery and hepatic colic. Dried fruit is given in fevers. Leaves are considered antipyretic, antipruritic and anthelmintic; employed in the treatment of scabies.","Systems of Medicines":"Folk, Unani,","Scientific Name":"averrhoa carambola","Traditional Uses":null,"Conservation Status":null,"Synonyms:":null},{"Unnamed: 0":16,"Family":"Fabaceae","Vernacular names":"Thakara, Ponthakara,തകര, പൊന്‍തകര(Malayalam),Wild senna(English),Prapunnata(Sanskrit),Chakavat(Hindi),Tagarai(Tamil)","Distribution":"South-America","Description":"Under shrubs. Leaves long, bearing a slender cylindric gland on the rachis between the leaflets of the lower 2 pairs. Flowers yellow, in few-flowered axillary racemes. Pods linear, indehiscent; seeds oblong, compressed, chestnut-brown.","Habit":"Shrub","Habitat":"Moist deciduous forests, also in the plains","Flowering & Fruiting":"August-December","Parts used":"Seeds, root and leaves","Properties & Uses":"Leaves are purgative, laxative and anthelmintic. The leaves are externally useful for curing ring worm and skin diseases. The pounded leaves are applied on cuts and wounds to promote healing, it is also used in gout and joint pains.","Systems of Medicines":"Ayurveda, Folk, Unani,","Scientific Name":"senna-tora","Traditional Uses":"The grinded leaf mixed with water and applied on deep wounds and cuts for quick healing.","Conservation Status":null,"Synonyms:":null},{"Unnamed: 0":17,"Family":"Lamiaceae","Vernacular names":"Kumbil, Kumizhu,കുമ്പിള്‍, കുമിഴ്(Malayalam),Candahar tree(English),Kashmari(Sanskrit),Gumhar(Hindi),Kattanam(Tamil)","Distribution":"Indo-Malesia","Description":"Medium trees, bark white or whitish-grey, smooth. Leaves simple, opposite, estipulate. Flowers bisexual, yellow with orange-pink shade, in terminal panicles. Fruit a drupe, ovoid; seeds 2-4, elliptic.","Habit":"Tree","Habitat":"Moist deciduous forests, also in the plains.","Flowering & Fruiting":"January-June","Parts used":"Root, bark, leaves and fruits","Properties & Uses":"Roots are bitter, astringent, digestive, cardio tonic, diuretic and laxative. Roots are used to improve digestion, strengthen memory, overcome giddiness, fever, thirst, emaciation, heart diseases, nervous disorders and piles. It is also useful in puerperal diseases and appetite loss. Root decoction or infusion is used to treat indigestion, fever and anasarca. Fruits are sweetish and bitter and used for the treatment of fever, bilious, anemia, leprosy, ulcers and consumption. Flowers are used to treat blood diseases and leprosy. Tender leaves used to treat cough.","Systems of Medicines":"Ayurveda, Folk, Unani,","Scientific Name":"gmelina arborea","Traditional Uses":null,"Conservation Status":null,"Synonyms:":null},{"Unnamed: 0":18,"Family":"Pandanaceae","Vernacular names":"Pookaitha, Kaitha,പൂക്കൈത, കൈത(Malayalam),Screw pine(English),Ketak(Sanskrit),Kettki(Hindi),Tazhai(Tamil)","Distribution":"Tropical-and-subtropical-Asia","Description":"Branched shrubs; trunk greyish-brown, ringed by leaf-scars and with basal prop roots. Leaves spirally arranged in 3 rows, linear-ensiform. Female inflorescence a solitary terminal cephalium. Male inflorescence of several spikes, with white or cream axillary bracts, Flowers creamy with yellow spathes. Fruit oblong, red-orange.","Habit":"Shrub","Habitat":"Mangrove forests and sea coasts","Flowering & Fruiting":"July-November","Parts used":"Whole plant","Properties & Uses":"Leaves are alexiteric, tonic and aphrodisiac; used in leprosy, small-pox, syphilis, scabies and leucoderma. Leaves and spadix are used in diabetes. Oil obtained from the bracts are considered stimulant and antispasmodic and are administered in headache and rheumatism. Root is considered diuretic, depurative and tonic.","Systems of Medicines":"Ayurveda, Folk, Unani,","Scientific Name":"pandanus-odorifer","Traditional Uses":null,"Conservation Status":null,"Synonyms:":null},{"Unnamed: 0":19,"Family":"Nymphaeaceae","Vernacular names":"Ambel, Vellambel,ആമ്പൽ, വെള്ളാമ്പൽ(Malayalam),Indian water lily,(English),Kumuda(Sanskrit),Nilotpalam(Tamil)","Distribution":"Indo-Malesia-and-Tropical-Africa","Description":"Rhizomatous aquatic herbs. Leaves alternate, elliptic or orbicular, reddish-purple beneath. Flowers deep red to purplish-white, slightly fragrant. Fruits globose with remnants of sepals, petals and stamens; seeds ellipsoid-globose.","Habit":"Aqualtic Plant","Habitat":"Ponds and pools in plains","Flowering & Fruiting":"Throughout the year","Parts used":"Rhizomes, flowers and seeds","Properties & Uses":"Powdered rhizomes are demulcent and diuretic; used in piles, dysentery and dyspepsia. Flowers are astringent, cardiotonic and refrigerant; alleviate cough, vomiting, giddiness, worms and burning of the skin. Filaments are astringent and cooling; useful in burning sensation, piles and menorrhagia. Seeds are cooling and used in medicines of cutaneous diseases.","Systems of Medicines":"Ayurveda, Folk,","Scientific Name":"nymphaea nouchali","Traditional Uses":null,"Conservation Status":null,"Synonyms:":null},{"Unnamed: 0":20,"Family":"Apocynaceae","Vernacular names":"Kadakapala, Kadavelapparintholi, Kudagapala,കുടകപ്പാല,  കുടഗപ്പാല(Malayalam),Ester tree, Ivory tree, Indrajao(English),Kudaja(Sanskrit),Karchi(Hindi),Kudagapala, Kuthuppalai, Veppai(Tamil)","Distribution":"Indo-Malesia","Description":"Small trees. Flowers bisexual, creamy-white, slightly fragrant, in terminal and axillary corymbose cymes, appear along with new leaves. Fruit of 2 terete elongated follicular mericarps connected at the tip and then free, seeds 8 mm, oblong, with tuft of silky brown hairs at the apex.","Habit":"Tree","Habitat":"Moist deciduous forests, also in the plains","Flowering & Fruiting":"April-October","Parts used":"Root, bark and seeds","Properties & Uses":"The root bark and seeds are used to treat chronic dysentery and diarrhea. The paste made from root helps to relieve rheumatic pain, gout and paralysis. The seed decoction is useful for relieving dysentery, bleeding piles, intestinal worms and fever.","Systems of Medicines":"Ayurveda, Folk, Homeo,","Scientific Name":"holarrhena-pubescens","Traditional Uses":"The bark decoction mixed with black pepper powder and taken internally to cure fever and dysentery.","Conservation Status":null,"Synonyms:":null},{"Unnamed: 0":21,"Family":"Colchicaceae","Vernacular names":"Menthonni,മേന്തോന്നി(Malayalam),Malabar glory lily(English),Langali(Sanskrit),Karihari(Hindi),Kalappaikkilangu(Tamil)","Distribution":"Paleotropics","Description":"Tendrillate climbers. Leaves subsessile, alternate, opposite or whorled. Flowers yellowish below and reddish above, axillary, solitary or in few-flowered, terminal racemes. Capsule ellipsoid-oblong.","Habit":"Climbers\/Lianas","Habitat":"Semi-evergreen, deciduous forests, also in the plains","Flowering & Fruiting":"July-December","Parts used":"Rhizomes","Properties & Uses":"Abortifacient, depurative, anthelmintic, digestive, purgative, antipyretic and rejuvenative. Rhizomes are used to treat inflammations, ulcers, parasitic skin diseases, leprosy, intermittent fever, debility, vomiting and burning sensation. It is also useful in promoting labour pain and expulsion of the placenta.","Systems of Medicines":"Ayurveda, Folk, Unani, Modern,","Scientific Name":"gloriosa superba","Traditional Uses":"Rhizome paste applied over the navel and vagina to minimize painful delivery. It induces labour pain and performs normal delivery.","Conservation Status":null,"Synonyms:":null}]